# StructuralAnalysis Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
GroupTypeId..::..StructuralAnalysis Property
GroupTypeId Class See Also
---
"Structural Analysis"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralAnalysis { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralAnalysis As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralAnalysis {
	ForgeTypeId^ get ();
}
```

# See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace